Revit 2024 API
RoutingPreferenceRule Constructor
 Constructs a RoutingPreferenceRule containing a segment or fitting Id (MEPPartId) and description.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public RoutingPreferenceRule(
	ElementId MEPPartId,
	string description
)
Visual Basic
Public Sub New ( _
	MEPPartId As ElementId, _
	description As String _
)
Visual C++
public:
RoutingPreferenceRule(
	ElementId^ MEPPartId,
	String^ description
)
Parameters
MEPPartId
Type: Autodesk.Revit.DB.ElementId
 The Id of the segment or fitting. InvalidElementId may be specified if no MEPPart will be allowed when the conditions satisfy the criteria in this rule.
description
Type: System.String
 The description of the rule.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
RoutingPreferenceRule Class
Autodesk.Revit.DB Namespace